---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalColor
source: html/dfedb4b9-6ef7-0100-cff1-34e0761498a8.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalColor Property

The property labeled "Color" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.